/*
  fcelib_fcetypes.h
  fcecodec Copyright (C) 2021 and later Benjamin Futasz <https://github.com/bfut>

  You may not redistribute this program without its source code.

  This program is free software; you can redistribute it and/or
  modify it under the terms of the GNU General Public License
  as published by the Free Software Foundation; either version 2
  of the License, or (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program; if not, write to the Free Software
  Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
*/

/**
  documents FCE format.
  implements FCE types with format validations.

FCE4/FCE4M format theoretical limits (assuming signed int):
  min filesize:            0x2038, except FCE3: 0x1F04
  max Reserve6offset:      2147483647 0x7FFFFFFF
  triangle size:           56         0x38
  vertice size:            12         0xC
  max triangle count:      38347921   0x2492491 (3 verts)
  max vert count:          4880644    0x4A7904 (x triags, 3*x verts)
  min triangle count:      0
  min vert count:          0
**/

#ifndef FCELIB_FCETYPES_H_
#define FCELIB_FCETYPES_H_

#include <limits.h>
#include <stdio.h>

#ifndef __cplusplus
typedef struct tVector tVector;
typedef struct tColor3 tColor3;
typedef struct tColor4 tColor4;
typedef struct FceHeader3 FceHeader3;
typedef struct FceHeader4 FceHeader4;
#endif

/*
  FCE3   tTriangle->flag   4 bit
      0x0   default             body parts: reflection
0:    0x1   matte (no chrome)
1:    0x2   high chrome
2:    0x4   no cull             two-faced triangle
3:    0x8   semi-transparent    all parts

5 = 1 + 4
6 = 2 + 4
A = 2 + 8
E = 2 + 4 + 8

Name    Application example                     Application example
0x000     car.fce   body
0x001     car.fce   underbody
0x002     car.fce   windows
0x004     car.fce
0x005     car.fce
0x006     car.fce
0x008     car.fce
0x00A     car.fce   semi-transparent windows
0x00E     car.fce   semi-transparent windows
0x00F     car.fce

A triangle is visible behind a semi-transparent triangle, if its index is smaller.
*/

/*
  FCE4   tTriangle->flag   12 bit
      0x0000   default             body parts: reflection,
                                   interior etc.: no reflection
0:    0x0001   matte (no chrome)
1:    0x0002   high chrome         body parts: used for windows etc.
2:    0x0004   no cull             two-faced triangle
3:    0x0008   semi-transparent    body parts: used for windows etc.

4:    0x0010   ?                   elni/car.fce :OH :OD :OLM :ORM :H**W :M**W, partial :HB :MB :LB :TB
5:    0x0020   all windows
6:    0x0040   front window
7:    0x0080   left window

8:    0x0100   back window
9:    0x0200   right window
10:   0x0400   broken window
11:   0x0800   ?
  FCE4M  tTriangle->flag   13 bit
12:   0x1000   ?                   <model>/part.fst

car.fce   body               default
car.fce   underbody          no reflection
car.fce   body roof          no cull
car.fce   windows            all windows + high chrome + no cull + semi-transparent
dash.fce  mirror glass       high chrome + semi-transparent

6 = 2 + 4
A = 2 + 8
E = 2 + 4 + 8

Name    Application example                     Application example
0x000   car.fce   body                          dash.fce  not mirror glass
0x001   car.fce   underbody
0x002
0x004   car.fce   body roof
0x005   car.fce
0x006
0x008   car.fce
0x00A                                           dash.fce  mirror glass
0x00E
0x00F
0x022   car.fce   right/left mirror glass
0x06A   car.fce   elni engine glass cover
0x06E   car.fce   front window
0x46E   car.fce   front window broken
0x0AE   car.fce   left window
0x4AE   car.fce   left window broken
0x12E   car.fce   back window
0x52E   car.fce   back window broken
0x22E   car.fce   right window
0x62E   car.fce   right window broken
*/

/* Length = 56. Vertex indices are local. Values from 'P1stVertices' make them global.

  Each vertex index points to a position and a normal. (FCE4/FCE4M: also damage position and damage normal)
  Vert positions and normals are stored in global coordinates.
  Vert positions are offset by their part positions, respectively. Normals are not offset.
*/
#if 0
struct tTriangle {
/* 0x00 */  int   tex_page;        /* Texture page number; > 0 in FCE3/FCE4 officer models, FCE4 pursuit road objects, FCE4M damage textures. Requires NumArts=max(tex_pages)-1 apart from the last */
/* 0x04 */  int   vidx[3];         /* Vertices local index */
/* 0x10 */  char  unknown[3 * 4];  /* all items = 0xFF00 or 0xFFFF */
/* 0x1C */  int   flag;            /* triangle flag */
/* 0x20 */  float U[3];            /* Vertices texture U-coordinates */
/* 0x2C */  float V[3];            /* Vertices texture V-coordinates */
};
#endif

struct tVector {
  float x;  /* x->inf is to the right */
  float y;  /* y->inf is up */
  float z;  /* z->inf is to the front */
};

/*
  Valid values for all four components: 0..255
  hue<degrees>  / 360 * 255
  saturation<%> / 100 * 255
  brightness<%> / 100 * 255
*/
struct tColor3 {
  int hue;
  int saturation;
  int brightness;
  int transparency;
};

struct tColor4 {
  unsigned char hue;
  unsigned char saturation;
  unsigned char brightness;
  unsigned char transparency;
};

/* 0x1F04  -  size of this header */
struct FceHeader3 {
/* 0x0000 */  int      Unknown1           ;  /* nullable, sometimes 0x13101000 (ex. render/pc/cone.fce) */
/* 0x0004 */  int      NumTriangles       ;  /* Number of triangles in model */
/* 0x0008 */  int      NumVertices        ;  /* Number of vertices in model */
/* 0x000C */  int      NumArts            ;  /* Number of arts, == 1 unless non-zero tex_pages are used */
                    /* offsets from 0x1F04 */
/* 0x0010 */  int      VertTblOffset      ;  /* usually 0x00. len() = 12 * NumVertices */
/* 0x0014 */  int      NormTblOffset      ;  /* len() = len(VertTbl) */
/* 0x0018 */  int      TriaTblOffset      ;  /* len() = 56 * NumTriangles */

/* 0x001C */  int      Reserve1offset     ;  /* len() = 32 * NumVertices */
/* 0x0020 */  int      Reserve2offset     ;  /* len() = len(VertTbl) */
/* 0x0024 */  int      Reserve3offset     ;  /* len() = len(VertTbl) */

/* 0x0028 */  float    HalfSize[3]        ;  /* X,Y,Z half-size width of whole model, defines bounding box for collision detection */

/* 0x0034 */  int      NumDummies         ;  /* Number of light sources 0..16 */
/* 0x0038 */  float    Dummies[16 * 3]    ;  /* Coordinates of dummies */

/* 0x00F8 */  int      NumParts           ;  /* Number of car parts 0..64 */
/* 0x00FC */  float    PartPos[64 * 3]    ;  /* Global position of car parts */

/* 0x03FC */  int      P1stVertices [64]  ;  /* First vertex index for each part */
/* 0x04FC */  int      PNumVertices [64]  ;  /* Number of vertices for each part */

/* 0x05FC */  int      P1stTriangles[64]  ;  /* First triangle index for each part */
/* 0x06FC */  int      PNumTriangles[64]  ;  /* Number of triangles for each part */

/* 0x07FC */  int      NumPriColors       ;  /* Number of primary colors 0..16 */
/* 0x0800 */  tColor3  PriColors[16]      ;  /* Primary colors */
/* 0x0900 */  int      NumSecColors       ;  /* Number of secondary colors 0..16 */
/* 0x0904 */  tColor3  SecColors[16]      ;  /* Secondary colors */

/* 0x0A04 */  char     DummyNames[16 * 64];  /* Dummy object names (ASCIIZ, role only by name) */

/* 0x0E04 */  char     PartNames [64 * 64];  /* Part names (ASCIIZ, role only by order) */

/* 0x1E04 */  char     Unknown2[256]      ;  /* nullable */
};

static
const char *kFce3PartsNames[FCELIB_UTIL_Fce3PartsImplemented] = {
  "high body",            /* car.fce */
  "left front wheel",
  "right front wheel",
  "left rear wheel",
  "right rear wheel",
  "medium body",
  "medium r front wheel",
  "medium l front wheel",
  "medium r rear wheel",
  "medium l rear wheel",
  "small body",
  "tiny body",
  "high headlights"
};

/*
car.fce (FCE3)
Part role is determined by order, listed names are canonical but optional (and
in fact nullable). Existence of parts is optional.
NB1: front wheel order is different for high body/medium body
NB2: only part 12 can be hidden lights
Name/Description         Idx  UsesFlag  Light  Reflection
high body                0    Y         N      Y
left front wheel         1    N         N      N
right front wheel        2    N         N      N
left rear wheel          3    N         N      N
right rear wheel         4    N         N      N
medium body              5    Y         N      Y
medium r front wheel     6    N         N      N
medium l front wheel     7    N         N      N
medium r rear wheel      8    N         N      N
medium l rear wheel      9    N         N      N
small body               10   Y         N
tiny body                11   N         N      N
high headlights          12   Y         Y      Y

cop#.fce (FCE3) - officer (# = 0-4)
Description              Idx  UsesFlag  Light  Reflection
officer                  0

cone.fce (FCE3) - traffic cone, unused
Name/Description         Idx  HasFlag  Light  Reflection
ConeH                    0    Y
ConeM                    1    Y
ConeL                    2    Y

go0#.fce (FCE3) - track menu model (# = 0-8)
Name/Description         Idx  UsesFlag  Light  Reflection
Loft01                   0    Y
Loft02                   1    Y

gengo.viv->go00.fce (FCE3) - developer logo, unused
Name/Description         Idx  UsesFlag  Light  Reflection
Line06                   0    Y
*/

/* 0x2038  -  size of this header */
struct FceHeader4 {
/* 0x0000 */  int      Version             ;  /* FCE4: 0x00101014, FCE4M: 0x00101015 */
/* 0x0004 */  int      Unknown1            ;  /* nullable */
/* 0x0008 */  int      NumTriangles        ;  /* Number of triangles in model */
/* 0x000C */  int      NumVertices         ;  /* Number of vertices in model */
/* 0x0010 */  int      NumArts             ;  /* Number of arts, == 1 (FCE4: unless non-zero tex_pages are used) */
                    /* offsets from 0x2038 */
/* 0x0014 */  int      VertTblOffset       ;  /* usually 0x0000. len() = 12 * NumVertices */
/* 0x0018 */  int      NormTblOffset       ;  /* len() = len(VertTbl) */
/* 0x001C */  int      TriaTblOffset       ;  /* len() = 56 * NumTriangles */

/* 0x0020 */  int      Reserve1offset      ;  /* len() = 32 * NumVertices */
/* 0x0024 */  int      Reserve2offset      ;  /* len() = len(VertTbl) */
/* 0x0028 */  int      Reserve3offset      ;  /* len() = len(VertTbl) */

/* 0x002C */  int      UndamgdVertTblOffset;  /* UndamgdVertTbl should be copy of VertTbl, unused in FCE4 */
/* 0x0030 */  int      UndamgdNormTblOffset;  /* UndamgdNormTbl should be copy of NormTbl, unused in FCE4 */
/* 0x0034 */  int      DamgdVertTblOffset  ;  /* len() = len(VertTbl) */
/* 0x0038 */  int      DamgdNormTblOffset  ;  /* len() = len(VertTbl) */

/* 0x003C */  int      Reserve4offset      ;  /* len() = 4 * NumVertices, null */
/* 0x0040 */  int      AnimationTblOffset  ;  /* len() = 4 * NumVertices, flags (0x4 = immovable, 0x0 othw) */
/* 0x0044 */  int      Reserve5offset      ;  /* len() = 4 * NumVertices, null */

/* 0x0048 */  int      Reserve6offset      ;  /* len() = 12 * NumTriangles, null
                                                FCE4M: len() += NumVertices */
/* 0x004C */  float    HalfSize[3]         ;  /* X,Y,Z half-size width of whole model, defines bounding box for collision detection */

/* 0x0058 */  int      NumDummies          ;  /* Number of light sources */
/* 0x005C */  float    Dummies[16 * 3]     ;  /* Coordinates of dummies */

/* 0x011C */  int      NumParts            ;  /* Number of car parts */
/* 0x0120 */  float    PartPos[64 * 3]     ;  /* Global position of car parts */

/* 0x0420 */  int      P1stVertices[64]    ;  /* First vertex index for each part */
/* 0x0520 */  int      PNumVertices[64]    ;  /* Number of vertices for each part */

/* 0x0620 */  int      P1stTriangles[64]   ;  /* First triangle index for each part */
/* 0x0720 */  int      PNumTriangles[64]   ;  /* Number of triangles for each part */

/* 0x0820 */  int      NumColors           ;  /* FCE4: Number of colors 0..16
                                                FCE4M: unknown purpose */
/* 0x0824 */  tColor4  PriColors[16]       ;  /* Primary colors */
/* 0x0864 */  tColor4  IntColors[16]       ;  /* Interior colors */
/* 0x08A4 */  tColor4  SecColors[16]       ;  /* Secondary colors */
/* 0x08E4 */  tColor4  DriColors[16]       ;  /* Driver hair colors */

/* 0x0924 */  int      Unknown3            ;  /* FCE4: nullable; FCE4M: unknown purpose, nullable */
/* 0x0928 */  char     Unknown2[256]       ;  /* nullable */

/* 0x0A28 */  char     DummyNames[16 * 64] ;  /* Dummy object names (ASCIIZ, role only by name) */

/* 0x0E28 */  char     PartNames [64 * 64] ;  /* Part names (ASCIIZ, role only by name) */

/* 0x1E28 */  char     Unknown4[528]       ;  /* nullable */
};

static
const char *kFce4HiBodyParts[FCELIB_UTIL_Fce4PartsHighBody] = {
  ":HB",            /* car.fce */
  ":OT",
  ":OL",
  ":OS",
  ":OLB",
  ":ORB",
  ":OLM",
  ":ORM",
  ":OC",
  ":ODL",
  ":OH",
  ":OD",
  ":HLFW",
  ":HRFW",
  ":HLMW",
  ":HRMW",
  ":HLRW",
  ":HRRW",
};

#ifdef __cplusplus
}  /* extern "C" */
#endif

/*
car.fce (FCE4)
":HB" is the only mandatory part
Name    Description              Damage  FallOf  UsesFlag  Light  Animated   Pursuit
:HB     high body                Y       N       Y         N      N          N
:MB     mid body                 Y       N       Y         N      N          N
:LB     low body                 Y       N       Y         N      N          N
:TB     tiny body                N       N       N         N      N          N
:OT     top                      Y       N       Y         N      N          N
